#
# ################################################################################
#
# Copyright (C) 2018 Splunk Inc.
#
# You should have received a copy of the Splunk Software Licese agreement
# along with TA-cef-for-splunk. If not, see:
# <http://www.splunk.com/en_us/legal/splunk-software-license-agreement.html>
#
# #################################################################################
#
[cef:syslog]
pulldown_type = 0
NO_BINARY_CHECK = 1
SHOULD_LINEMERGE = false
TIME_PREFIX = \s(end|rt)\ =
TIME_FORMAT = %10s%3N
MAX_TIMESTAMP_LOOKAHEAD = 350
SEDCMD-lf = s/\\r//g
TRANSFORMS-aheader = ta_cef_for_splunk_v0_sl_host
TRANSFORMS-bheader = ta_cef_for_splunk_v0_header,ta_cef_for_splunk_v0_source,ta_cef_for_splunk_v0_source_arcsight
TRANSFORMS-zzzstrip = ta_cef_for_splunk_v0_ext,ta_cef_for_splunk_v0_sourcetype

[cef:file]
MAX_TIMESTAMP_LOOKAHEAD = 350
NO_BINARY_CHECK = 1
REPORT-fields = ta_cef_for_splunk_v0_fields
SEDCMD-lf = s/\\r//g
SHOULD_LINEMERGE = false
TIME_FORMAT = %10s%3N
TIME_PREFIX = \s(end|rt)\ =
TRANSFORMS-bheader = ta_cef_for_splunk_v0_header,ta_cef_for_splunk_v0_source,ta_cef_for_splunk_v0_source_arcsight
TRANSFORMS-zzzstrip = ta_cef_for_splunk_v0_ext,ta_cef_for_splunk_v0_sourcetype
pulldown_type = 0

[cef]
KV_MODE = NONE
LEARN_SOURCETYPE = false
LEARN_MODEL = false
ANNOTATE_PUNCT = false
SHOULD_LINEMERGE = false
pulldown_type = 0


REPORT-fields = ta_cef_for_splunk_v0_fields, ta_cef_for_splunk_v0_cfields
FIELDALIAS-act = act AS vendor_action
FIELDALIAS-cat = cat AS vendor_category
FIELDALIAS-dhost = dhost AS dest_host
FIELDALIAS-dhost_nthost = dhost AS dest_nt_host
FIELDALIAS-dmac = dmac AS dest_mac
FIELDALIAS-dntdom = dntdom AS dest_nt_domain
FIELDALIAS-dpid = dpid AS dest_pid
FIELDALIAS-dproc = dproc AS dest_process
FIELDALIAS-dpt = dpt AS dest_port
FIELDALIAS-dst = dst AS dest_ip
FIELDALIAS-duid = duid AS dest_user_id
FIELDALIAS-duser = duser AS dest_user
FIELDALIAS-dvchost = dvchost AS dvc_host
FIELDALIAS-dvcmac = dvcmac AS dvc_mac
FIELDALIAS-dvcip = dvc AS dvc_ip
FIELDALIAS-deviceNtDomain = deviceNtDomain AS dvc_nt_domain
FIELDALIAS-dvcpid = dvcpid AS dvc_pid
FIELDALIAS-eventId = eventId AS event_id
FIELDALIAS-fileHash = fileHash AS file_hash
FIELDALIAS-filePath = filePath AS file_path
FIELDALIAS-fname = fname AS file_name
FIELDALIAS-fsize = fsize AS file_size
FIELDALIAS-in = in AS bytes_in
FIELDALIAS-msg = msg AS message
FIELDALIAS-out = out AS bytes_out
FIELDALIAS-outcome = outcome AS vendor_outcome
FIELDALIAS-proto = proto AS protocol
FIELDALIAS-reason = reason AS vendor_reason
FIELDALIAS-request = request AS url
FIELDALIAS-shost = shost AS src_ip
FIELDALIAS-shost_nthost = shost AS src_nt_host
FIELDALIAS-smac = smac AS src_mac
FIELDALIAS-sntdom = sntdom AS src_nt_domain
FIELDALIAS-spid = spid AS src_pid
FIELDALIAS-sproc = sproc AS src_process
FIELDALIAS-spt = spt AS src_port
FIELDALIAS-suid = suid as src_user_id
FIELDALIAS-suser = suser AS src_user

EVAL-cf1 = null()
EVAL-cf1Label = null()
EVAL-cf2 = null()
EVAL-cf2Label = null()
EVAL-cf3 = null()
EVAL-cf3Label = null()
EVAL-cf4 = null()
EVAL-cf4Label = null()
EVAL-cf5 = null()
EVAL-cf5Label = null()
EVAL-cf6 = null()
EVAL-cf6Label = null()

EVAL-cn1 = null()
EVAL-cn1Label = null()
EVAL-cn2 = null()
EVAL-cn2Label = null()
EVAL-cn3 = null()
EVAL-cn3Label = null()
EVAL-cn4 = null()
EVAL-cn4Label = null()
EVAL-cn5 = null()
EVAL-cn5Label = null()
EVAL-cn6 = null()
EVAL-cn6Label = null()
EVAL-cn7 = null()
EVAL-cn7Label = null()
EVAL-cn8 = null()
EVAL-cn8Label = null()
EVAL-cn9 = null()
EVAL-cn9Label = null()

EVAL-cs1 = null()
EVAL-cs1Label = null()
EVAL-cs2 = null()
EVAL-cs2Label = null()
EVAL-cs3 = null()
EVAL-cs3Label = null()
EVAL-cs4 = null()
EVAL-cs4Label = null()
EVAL-cs5 = null()
EVAL-cs5Label = null()
EVAL-cs6 = null()
EVAL-cs6Label = null()
EVAL-cs7 = null()
EVAL-cs7Label = null()
EVAL-cs8 = null()
EVAL-cs8Label = null()
EVAL-cs9 = null()
EVAL-cs9Label = null()

EVAL-c6a1 = null()
EVAL-c6a1Label = null()
EVAL-c6a2 = null()
EVAL-c6a2Label = null()
EVAL-c6a3 = null()
EVAL-c6a3Label = null()
EVAL-c6a4 = null()
EVAL-c6a4Label = null()
EVAL-c6a5 = null()
EVAL-c6a5Label = null()
EVAL-c6a6 = null()
EVAL-c6a6Label = null()
EVAL-c6a7 = null()
EVAL-c6a7Label = null()
EVAL-c6a8 = null()
EVAL-c6a8Label = null()
EVAL-c6a9 = null()
EVAL-c6a9Label = null()

EVAL-dest = coalesce(dhost,dhost_ip,dmac)
EVAL-dvc = coalesce(dvc_host,dvc_ip)
EVAL-src = coalesce(shost,src,smac)
